#include "LedControl.h"

LedControl dot = LedControl(12, 11, 10, 1);  // 핀번호 (din, clk, cs, 매트릭수 개수 설정)

byte A[] = { B00000000,B11100111,B01000010,B01000010,B01000010,B00000000,B00111100,B00000000 };
byte B[] = { B01000010,B10100101,B00001000,B00001000,B00011000,B01000010,B00111100,B00000000 };
byte C[] = { B00000000,B10000001,B01000010,B00100100,B01000010,B10000001,B00111100,B00000000 };
byte Q[] = { B00111000,B01000100,B01000100,B00001000,B00010000,B00010000,B00000000,B00010000 };
byte W[]={B00000001,B00000010,B00000100,B00001000,B00010000,B00100000,B01000000,B10000000};
//원하는 모양의 도트매트릭스를 그려주세요.

void setup() {
  Serial.begin(9600);
  dot.shutdown(0, false);  //절전모드
  dot.setIntensity(0,10); //밝기조정(15깢
  dot.clearDisplay(0); //초기화
  }

void loop() {
 for(int i = 0; i < 8 ; i++)
      dot.setRow(0, i , W[i]);   


}

